{
    "workoutName": "Aerobic & Strength Exercises",
    "goals": [
        "Increase Muscle Endurance",
        "Increase Stamina"
    ],
    "days": [
        {
            "day": "1",
            "name": "Endurance - Focused Workout",
            "duration": "90 Minutes",
            "description": "Warm-Up (7 Minutes)\nWarm-Up: Arm Swings (2 Minutes)\nDescription: Swing both arms forward and backward in large, controlled arcs. Alternate directions every 30 seconds.\nWarm-Up: Standing Hip Circles (2 Minutes)\nDescription: Stand with feet shoulder-width apart, place hands on hips, and rotate hips in a large circle. Perform 10 circles clockwise, then 10 counterclockwise.\nWarm-Up: Dynamic Lunges with Torso Twist (3 Minutes)\nDescription: Step forward into a lunge, then twist your torso toward your forward leg. Alternate sides for 10 reps each leg.\nExercise 1: Endurance Circuit (30 Minutes)\nRepeat 3 rounds with 2-minute rest between rounds:\nWall Sit with Heel Lifts – 1 Minute\nDescription: Hold a wall sit position while alternating lifting heels off the ground, activating quads and calves.\nRest 20 seconds\nPlank Hold with Slow Arm Reaches – 1 Minute\nDescription: Maintain a plank while slowly reaching one arm forward, alternating sides to engage the core and shoulders.\nRest 20 seconds\nStep-Ups with Controlled Descents – 1 Minute\nDescription: Step onto a box or bench with one leg, then step down slowly to focus on eccentric control.\nRest 20 seconds\nBear Crawl – 1 Minute\nDescription: Move forward and backward in a crawling position, keeping knees close to the ground and engaging the core.\nRest 30 seconds\nSlow-Paced High Knees – 1 Minute\nDescription: Bring your knees up to hip height at a slower, deliberate pace to emphasize endurance and control.\nRest 30 seconds\nSuperman Hold – 1 Minute\nDescription: Lie face down and lift arms, chest, and legs off the ground, holding to strengthen the lower back and glutes.\nRest 2 Minute\nExercise 2: Core Endurance Circuit (24 Minutes)\nRepeat 3 rounds with 2-minute rest between rounds:\nSide Plank with Reach-Through – 45 Sec Each Side, 15 Sec Rest (1 Minute)\nDescription: In a side plank, reach your top arm under your torso and back up to work obliques.\nDead Bug – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back, extend opposite arm and leg downward, alternating sides slowly for core stability.\nSeated Leg Circles – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Sit slightly reclined with legs extended and make small, controlled circles with both legs, engaging the lower abs.\nFlutter Kicks – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back and alternate small, quick leg kicks to target the core and hip flexors.\nSlow Bicycle Crunches – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform a bicycle crunch with slow, deliberate movements to engage all sections of the abs.\nBoat Pose Hold – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Hold a boat pose with legs lifted and torso reclined, engaging the core.\nRest 2 Minutes\nExercise 3: Long-Duration Burnout Circuit (24 Minutes)\nRepeat 3 rounds with 1-minute rest between rounds:\nLow-Impact Burpees – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform a burpee at a slower pace, skipping the jump at the top to maintain endurance.\nBodyweight Squat with 3-Second Hold – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lower into a squat and hold for 3 seconds at the bottom before standing.\nStatic Lunge Hold – 20 Sec Each Side, 20 Sec Rest (1 Minute)\nDescription: Hold a lunge position with knees bent at 90 degrees, keeping the back straight and chest lifted.\nResistance Band Rows – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Use a resistance band to perform slow, controlled rows to strengthen the back and arms.\nStanding Calf Raises – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Slowly rise onto the balls of your feet and lower back down, focusing on the calves.\nFarmer’s Carry – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Hold a dumbbell or heavy object in each hand and walk slowly while maintaining a tight core and upright posture.\nRest 2 minutes\nPost-Workout Stretch (5 Minutes)\nStanding Forward Fold – 1 Minute \nDescription: Bend at the hips and let your head hang, stretching the hamstrings and lower back.\nSeated Forward Fold – 1 Minute\nDescription: Sit with legs extended and reach forward to stretch the hamstrings and calves.\nCat-Cow Stretch – 1 Minute\nDescription: Alternate between arching and rounding your back in a tabletop position to stretch the spine.\nRunner’s Lunge Stretch – 1 Minute\nDescription: Hold a deep lunge position to stretch the hip flexors and quads. Alternate sides after 1 minute.\nButterfly Stretch – 1 Minute\nDescription: Sit with soles of your feet together, gently pressing knees toward the ground to stretch the inner thighs.\nThis workout emphasizes endurance through slower, controlled movements and sustained holds while integrating both cardio and strength elements for long-duration exertion"
        },
        {
            "day": "2",
            "name": "Endurance- Focused Workout",
            "duration": "90 Minutes",
            "description": "Warm-Up (7 Minutes)\nStanding Arm Crossovers (2 Minutes): Swing arms across your chest, alternating the top arm.\nLateral Lunges with Reach (2 Minutes): Step to the side, sink into a lunge, and reach toward the foot. Alternate sides.\nHigh Knee Walks (3 Minutes): March forward with high knees, reaching toward the opposite knee with each step.\nExercise 1: Endurance Circuit (30 Minutes)\nRepeat 3 rounds with 2-minute rest:\nGlute Bridge March – 1 Minute\nDescription: In a glute bridge position, alternate lifting knees toward the chest.\nRest 20 seconds\nPush-Up to Shoulder Tap – 1 Minute\nDescription: Perform a push-up, then tap one shoulder with the opposite hand, alternating sides.\nRest 20 seconds\nSplit Squat Hold – 30 Sec Each Side\nDescription: Hold a lunge position without moving, keeping tension in the legs.\nRest 20 seconds\nSide-Stepping Squats – 1 Minute\nDescription: Take a step to the side, squat, return to standing, and repeat.\nRest 30 seconds\nSlow Jumping Jacks – 1 Minute\nDescription: Perform jumping jacks at a controlled pace.\nRest 30 seconds\nReverse Plank Hold – 1 Minute\nDescription: Sit with legs extended, lift hips toward the ceiling, engaging glutes and shoulders.\nRest 2 minutes\n\nExercise 2: Core Endurance Circuit (24 Minutes)\nRepeat 3 rounds with 1-minute rest:\nPlank Shoulder Taps – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: In a plank, alternate tapping shoulders with opposite hands.\nSide Lying Leg Lifts – 45 Sec Each Side (1.5 Minutes)\nDescription: Lie on your side and lift the top leg, engaging the obliques and hip flexors.\nHollow Body Hold – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back and lift arms and legs off the ground, holding a tight position.\nStanding Side Crunches – 45 Sec Each Side (1.5 Minutes)\nDescription: Stand and bring one knee up while crunching your torso sideways.\nStraight-Leg Sit-Ups – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform sit-ups with legs extended straight in front of you.\nSide Plank with Arm Reach – 45 Sec Each Side (1 Minute)\nDescription: Hold a side plank and extend the top arm overhead.\nRest 1 Minute\n\nExercise 3: Long-Duration Burnout Circuit (24 Minutes)\n\nRepeat 3 rounds with 2-minute rest:\nWall Ball Squats – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform squats with a medicine ball, throwing it against a wall.\nFarmer’s Carry with High Knees – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Hold weights and march in place with high knees.\nStep-Up to Knee Drive – 20 Sec Each Side, 20 Sec Rest (1 Minute)\nDescription: Step onto a bench and drive the opposite knee upward.\nPlank to Side Plank Rotations – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Transition from a forearm plank to a side plank on each side.\nBodyweight Good Mornings – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Hinge at the hips and return to standing, keeping your back straight.\nBox Shuffle – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Stand in front of a box and step up, down, and around quickly.\nRest 2 Minutes\nCool Down (5 Minutes)\nLight Jump Rope (5 Minutes): A steady pace, focusing on rhythmic breathing."
        },
        {
            "day": "3",
            "name": "Endurance- Focused Workout",
            "duration": "90 Minutes",
            "description": "Warm-Up (7 Minutes)\nOverhead Arm Stretch (2 Minutes): Alternately reach arms overhead and pull gently.\nStep-Back Lunges (2 Minutes): Step back into a lunge, alternating sides.\nDynamic Hamstring Kicks (3 Minutes): Swing one leg forward and touch it with the opposite hand, alternating sides.\nExercise 1: Endurance Circuit (30 Minutes)\nRepeat 3 rounds with 2-minute rest:\nIsometric Push-Up Hold – 1 Minute\nDescription: Lower halfway into a push-up and hold.\nRest 20 seconds\nSlow Side Lunges – 1 Minute\nDescription: Alternate side lunges, focusing on depth and control.\nRest 20 seconds\nResistance Band Rows – 1 Minute\nDescription: Use a resistance band to perform slow, controlled rows.\nRest 20 seconds\nSingle-Leg Romanian Deadlifts – 30 Sec Each Side\nDescription: Balance on one leg, hinging forward to engage the hamstrings and glutes.\nRest 30 seconds\nHalf-Burpees – 1 Minute\nDescription: Perform burpees without the jump.\nRest 30 seconds\nLying Leg Abductions – 1 Minute\nDescription: Lie on your side and raise your top leg.\nRest 2 Minutes\nExercise 2: Core Endurance Circuit (24 Minutes)\nSide Plank with Leg Lift – 45 Sec Each Side (1.5 Minutes)\nDescription: In a side plank, lift the top leg slowly.\nBird Dog – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Extend opposite arm and leg while on all fours, alternating sides.\nWindshield Wipers – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back with legs up and rotate them side to side.\nModified V-Ups – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform V-ups with knees bent.\nMountain Climbers – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Alternate driving knees toward the chest at a controlled pace.\nReverse Crunches – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Bring knees toward the chest, lifting hips off the floor.\nRest 1.5 Minutes\nExercise 3: Long-Duration Burnout Circuit (24 Minutes)\nRepeat 3 rounds with 1-minute rest:\nLateral Step-Overs – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Step laterally over a bench or object.\nKettlebell Swings 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Swing a kettlebell with controlled hip thrusts.\nDynamic Side Plank Dips – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Alternate between side planks with a quick hip dip.\nWalking Lunges – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform forward lunges, alternating sides.\nBear Hold with Knee Taps – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Hold a bear crawl position and tap knees to the ground slowly.\nForward and Backward Bounds – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Bound forward and backward, landing softly.\nRest 2 Minutes\nCool Down (5 Minutes)\nJumping Jacks (5 Minutes): Perform at a steady pace."
        },
        {
            "day": "4",
            "name": "Endurance- Focused Workout",
            "duration": "90 Minutes",
            "description": "Warm-Up (7 Minutes)\nDynamic Toe Touches (2 Minutes): Swing one leg forward and reach for your toes with the opposite hand, alternating sides.\nWorld’s Greatest Stretch (2 Minutes): Step into a lunge, rotate your torso, and reach one arm overhead. Alternate sides.\nButt Kicks (3 Minutes): Jog in place, bringing your heels to your glutes.\n\nExercise 2: Core Endurance Circuit (24 Minutes)\nRepeat 3 rounds with 1.5-minute rest:\nReverse Plank with Knee Drive – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: In a reverse plank, alternate driving knees toward the chest.\nAlternating Toe Reaches – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back and reach for opposite toes with alternating hands.\nLeg Scissors – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back and alternate crossing your legs over each other.\nSide Plank Thread the Needle – 45 Sec Each Side (1 Minute)\nDescription: In a side plank, rotate your torso and thread the top arm under your body.\nSlow Mountain Climbers – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform mountain climbers with a slow, controlled motion.\nSuperman Lifts – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lift your chest and legs off the ground in a prone position, then lower slowly.\nRest 1.5 Minute\nExercise 3: Long-Duration Burnout Circuit (24 Minutes)\nRepeat 3 rounds with 2-minute rest:\nForward Bounds with Controlled Landing – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Jump forward as far as possible and land softly, focusing on control.\nLateral Band Walks – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Place a resistance band around your thighs and take slow, controlled side steps.\nBox Hold with Alternating Toe Taps – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Sit in a boat pose and tap your toes to the floor alternately.\nSlow Climber Deadlifts – 20 Sec Each Side, 20 Sec Rest (1 Minute)\nDescription: Perform a single-leg deadlift, moving slowly and deliberately.\nPlank with Alternating Side Taps – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: In a plank, tap one leg out to the side and back, alternating sides.\nStanding Jump Twists – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Jump in place while twisting your upper and lower body in opposite directions.\nRest 2 Minute\nPost-Workout Stretch (5 Minutes)\nSeated Forward Fold with Side Reach – 1 Minute\nDescription: Stretch forward and alternate reaching to each leg.\nButterfly Stretch with Gentle Bounce – 1 Minute\nDescription: Press knees downward gently for a deeper stretch.\nLow Lunge with Side Bend – 1 Minute\nDescription: Hold a low lunge and reach your arm over your head to stretch the side body.\nThread the Needle Stretch – 1 Minute\nDescription: From a tabletop position, thread one arm under the other and twist gently.\nSupine Twist – 1 Minute\nDescription: Lie on your back and twist your lower body to one side, alternating after 1 minute."
        }
    ]
}