{
    "workoutName": "Anaerobic Exercises (60-minutes)",
    "goals": [
        "Increase Muscle Strength",
        "Gain Muscle Mass"
    ],
    "days": [
        {
            "day": "1",
            "name": "Chest, Shoulders, and Triceps",
            "duration": "60 Minutes",
            "description": "Warm-Up (7.5 Minutes)\nChest Opener Stretch (2 minutes)\nStand with feet shoulder-width apart and clasp your hands behind your back. Straighten your arms and lift them slightly while puffing out your chest. Hold for 30 seconds.\nHalos Right & Left (1.5 minutes)\nHalos can be performed with a medicine ball, weight plate, dumbbell, or kettlebell. Begin by standing straight with your shoulders relaxed. Hold your weight of choice in front of you. Lift the weight slightly above your shoulders in front of your face. Now take the weight and begin moving to the left, making a slow circle all the way around your head.\nInternal Rotations (2 minutes)\n This exercise will be performed with either a light dumbbell or exercise band. If you are using an exercise band you MUST safely secure it to a stationary object that will not move when tension is applied to the band. Tuck your right elbow into your side. With your right hand, hold either the dumbbell or exercise band at waist height, in front of you. Tuck your right elbow into your side and at a slow, controlled speed, rotate your arm so that your right hand is now in front of your torso\nExternal Rotations (2 minutes)\nThis exercise is similar to the internal rotations, but this time instead of rotating your arm so that it ends up in front of your torso, we will be rotating it away from your body. This will be performed with either a light dumbbell or exercise band. If you are using an exercise band you MUST safely secure it to a stationary object that will not move when tension is applied to the band. Tuck your right elbow into your side. With your right hand, hold either the dumbbell or weight band at waist height, in front of you. Tuck your right elbow into your side and at a slow, controlled speed, rotate your arm so that your right hand and forearm are now perpendicular to your body. \n\n\nExercise 1: Bench Press (8.5 Minutes)\nSet #1: 15 Presses (1.5 minutes)\n1 minute break\nSet #2: 15 Presses (1.5 minutes)\n1 minute break\nSet #3: 15 Presses (1.5 minutes)\n1 minute break\nNecessary Equipment: Barbell and Weights\nDescription: Lie face up on a horizontal bench with buttocks on the bench and feet flat on the ground. Grasp the barbell with an overhand grip wider than shoulder width, lower the bar to the chest with a controlled movement, and extend the arms while exhaling.\nRest 1 Minute\n\nExercise 2: Seated Front Press (7.5 Minutes)\nSet #1: 12 Presses (1 minute)\n1 minute break\nSet #2: 12 Presses (1 minute)\n1 minute break\nSet #3: 12 Presses (1 minute)\n1 minute break\nNecessary Equipment: Barbell and Weights\nDescription: Sit with the back straight and hold the bar with an overhand grip, resting it across the upper chest.\nRest 1.5 Minute\n\nExercise 3: Push-Downs (5.5 minutes)\nSet #1: 15 press downs (1 minute)\n30 second break\nSet #2: 15 press downs (1 minute)\n30 second break\nSet #3: 15 press downs (1 minute)\n30 second break\nNecessary Equipment: Cable Machine and Rope \nDescription: Stand with back to the machine and grasp the handle with an overhand grip keeping the elbows tucked in\nBreak 1 Minutes\n\n\nExercise 4: Parallel Bar Dips (8 Minutes)\nSet #1: 12 Dips (1 minute)\n1 minute break\nSet #2: 12 Dips (1 minute)\n1 minute break\nSet #3: 12 Dips (1 minute)\n1 minute break\nDescription: Hang from the parallel bars with arms extended and legs suspended; bend the elbows to bring the chest level with the bars. Return to the extended position, exhale at the end of the effort.\nRest 2 Minute\n\nExercise 5: Lateral Dumbbell Raises (8 minutes)\nSet #1: 12 Presses (1 minute)\n1 minute break\nSet #2: 12 Presses (1 minute)\n1 minute break\nSet #3: 12 Presses (1 minute)\n1 minute break\nNecessary Equipment: Dumbbells \nDescription: Stand with a straight back, with legs slightly apart,arms hanging next to the body,holding a dumbbell in each hand : raise the arms to horizontal with the elbows slightly bent and return to the initial position\nBreak 2 Minutes\n\nExercise 6: Incline Barbell Press (9 Minutes)\nSet #1: 15 Presses (1.5 minutes)\n1 minute break\nSet #2: 15 Presses (1.5 minutes)\n1 minute break\nSet #3: 15 Presses (1.5 minutes)\n1 minute break\nNecessary Equipment: Barbell and Weights\nDescription: Sit on the incline bench press angled 45 to 60 degrees, grasp the barbell with an overhand grip wider than shoulder width.\nRest 1.5 Minute\n\nPost-Workout Stretch (6 Minutes)\nDoorway Chest Stretch (2 Minutes)\nStand in a doorway, placing your arms on either side of the frame with elbows bent at 90 degrees. Step forward slightly to stretch your chest. Hold for 30 seconds.\nStanding Chest Stretch (2 Minutes)\nStand tall and extend one arm straight out to the side at shoulder height. Place your palm on a wall or sturdy surface and gently turn your body away from your arm to feel the stretch in your chest. Hold for 30 seconds per side.\nCross-Body Shoulder Stretch (2 Minutes)\nExtend one arm across your body at shoulder height, and use your other hand to gently pull it closer to your chest. Hold for 30 seconds on each side."
        },
        {
            "day": "2",
            "name": "Back and Biceps",
            "duration": "60 Minutes",
            "description": "Warm-Up (6 Minutes)\nDynamic Lat Stretch (2 Minutes)\nStand with your feet shoulder-width apart. Reach one arm overhead and bend to the opposite side, stretching the side of your torso. Alternate sides for 10 reps.\nThoracic Spine Rotation (2 Minutes)\nStand with your arms extended in front of you at shoulder height. Rotate your torso to one side, then the other, keeping your hips stable. Perform 10 reps per side.\nFoam Roller Back Extension (2 minutes)\nSit on the floor with your knees bent and feet planted. Place a foam roller just above your lower back where your bottom ribs are. Lie back on the roller and reach your arms up overhead. Gently bend backward over the roller while exhaling, pushing your arms back and toward the floor. Come back up and move the foam roller up your back a few inches. Repeat this until the roller is in line with your shoulders.\n\nExercise 1: Reverse Chin-Ups (7 Minutes)\nSet #1: 10 Chin-Ups (1 minute)\n1 minute break\nSet #2: 10 Chin-Ups (1 minute)\n1 minute break\nSet #3: 10 Chin-Ups (1 minute)\n1 minute break\nNecessary Equipment: Fixed Bar\nDescription: Hang from a bar with an underhand grip, hands shoulder-width apart, and push out the chest as you raise the chin to the bar.\nRest 1 Minute\n\nExercise 2: Hammer Curls (7 minutes)\nSet #1: 15 curls (1 minute)\n1 minute break\nSet #2: 15 curls (1 minute)\n1 minute break\nSet #3: 15 curls (1 minute)\n1 minute break\nNecessary Equipment: Dumbbells \nDescription: Stand or sit gripping a dumbbell in each hand with the palms facing each other\nBreak 1 Minutes\n\nExercise 3: Lat Pull-Down (9 Minutes)\nSet #1: 15 Pulls (1.5 minutes)\n1 minute break\nSet #2: 15 Pulls (1.5 minutes)\n1 minute break\nSet #3: 15 Pulls (1.5 minutes)\n1 minute break\nNecessary Equipment: Lat Pulldown Machine\nDescription: Sit facing the machine with the legs positioned under the pads, gripping the bar with a wide overhand grip, and pull the bar down to the sternal notch while puffing out the chest and pulling the elbows back.\nRest 1.5 Minute\n\nExercise 4: Seated Rows (9 Minutes)\nSet #1: 15 Rows (1.5 minutes)\n1 minute break\nSet #2: 15 Rows (1.5 minutes)\n1 minute break\nSet #3: 15 Rows (1.5 minutes)\n1 minute break\nNecessary Equipment: Row Machine\nDescription: Sit facing the machine, feet resting on the foot pad, and torso bent forward. Bring the handle to the base of the sternum by straightening the back and pulling the elbows back.\nRest 1.5 Minute\n\nExercise 5: Dumbbell Curls (7 Minutes)\nSet #1: 15 Curls (1 minute)\n1 minute break\nSet #2: 15 Curls (1 minute)\n1 minute break\nSet #3: 15 Curls (1 minute)\n1 minute break\nNecessary Equipment: Dumbbells \nDescription: Sit holding a dumbbell in each hand with arms hanging down and the palms of the hands facing the body\nBreak 1 Minute\n\n\nExercise 6: Bent-Over Row (10 minutes)\nSet #1: 15 Rows (1.5 minutes)\n1.5 minute break\nSet #2: 15 Rows (1.5 minutes)\n1.5 minute break\nSet #3: 15 Rows (1.5 minutes)\n1.5 minute break\nNecessary Equipment: Barbell\nDescription: Do heavy bent-over rows toward the start of your back workout in lower rep ranges, such as 6-8 or 8-10, in order to save your lower back\nRest 1 Minute\n\nPost-Workout Stretch (6 Minutes)\nChild’s Pose (2 Minutes)\nKneel on the floor, sit back on your heels, and stretch your arms forward while lowering your chest toward the ground. Hold for 30 seconds.\nBicep Wall Stretch (2 Minutes)\nStand near a wall and place your palm flat against it at shoulder height. Slowly rotate your body away from the wall until you feel a stretch in your biceps and chest. Hold for 20-30 seconds per side.\nStanding Lat Stretch (2 Minutes)\nStand tall, reach one arm overhead, and gently bend to the opposite side, stretching your lat muscles. Hold for 30 seconds per side."
        },
        {
            "day": "3",
            "name": "Legs",
            "duration": "60 Minutes",
            "description": "Warm-Up (5 Minutes)\nWalking Lunges (3 Minutes)\nStep forward into a lunge, then push off your front foot to step into the next lunge. Continue alternating legs for 10 steps per side.\nDownward-Dog To Cobra (2 minutes)\nTransition from Downward Dog by shifting into Plank, lowering halfway to Chaturanga, then pressing into Cobra with your chest lifted and shoulders relaxed.\n\nExercise 1: Dumbbell Squats (8 Minutes)\nSet #1: 15 Squats (1 minutes)\n1 minute break\nSet #2: 15 Squats (1 minutes)\n1 minute break\nSet #3: 15 Squats (1 minutes)\n1 minute break\nNecessary Equipment: Dumbbells\nDescription: Stand with the feet slightly apart, holding a dumbbell in each hand. Bend the knees, keeping the back straight until thighs are horizontal.\nRest 1 Minute\nExercise 2: Front Squats (9 Minutes)\nSet #1: 15 Squats (1.5 minutes)\n1 minute break\nSet #2: 15 Squats (1.5 minutes)\n1 minute break\nSet #3: 15 Squats (1.5 minutes)\n1 minute break\nNecessary Equipment: Barbell\nDescription: Stand with the legs shoulder-width apart, holding the bar with an overhand grip resting on the upper chest. Bend the knees to lower the thighs horizontal to the floor.\nRest 1.5 Minute\n\nExercise 3: Power Squats (9 Minutes)\nSet #1: 15 Squats (1.5 minutes)\n1 minute break\nSet #2: 15 Squats (1.5 minutes)\n1 minute break\nSet #3: 15 Squats (1.5 minutes)\n1 minute break\nNecessary Equipment: Barbell\nDescription: Perform the classic squat with legs farther apart and toes pointing out, focusing on the inner thigh and glute muscles.\nRest 1.5 Minute\n\nExercise 4: Leg Extensions (8 Minutes)\nSet #1: 15 Extensions (1 minute)\n1 minute break\nSet #2: 15 Extensions (1 minute)\n1 minute break\nSet #3: 15 Extensions (1 minute)\n1 minute break\nNecessary Equipment: Leg Extension Machine\nDescription: Sit at the machine, grasp the handles, and extend your legs to horizontal.\nRest 2 Minute\n\nExercise 5: Hamstrings Curl (8 Minutes)\nSet #1: 10 Curls (1 minute)\n1 minute rest\nSet #2: 10 Curls (1 minute)\n1 minute rest\nSet #3: 10 Curls (1 minute)\n1 minute rest\nNecessary equipment: Hamstring curl machine\nLay face down and bend your knees to lift your heels toward your glutes, contracting your hamstrings, before slowly lowering back down\n\nExercise 6: Calf Raises (7 Minutes)\nSet #1: 20 Calf Raises (1 Minute)\n1 minute break\nSet #2: 20 Calf Raises (1 Minute)\n1 minute break\nSet #3: 20 Calf Raises (1 Minute)\n1 minute break\nNecessary equipment: Dumbbells\nStand with feet hip-width apart and lift your heels off the ground to rise onto your toes, engaging the calf muscles before lowering back down\n1 minute break\n\nPost-Workout Stretch (6 Minutes)\nStanding Quad Stretch (2 Minutes)\nStand on one leg, grab your other foot behind you, and gently pull it toward your glutes. Hold for 30 seconds per leg.\nPigeon Pose (2 Minutes)\nFrom a plank position, bring one knee toward your hand and lay the outside of your shin on the ground, extending your other leg behind you. Hold for 30 seconds per side.\nCalf Stretch (2 Minutes)\nStand facing a wall and place one foot forward with your knee bent. Keep your other leg extended behind you with your heel on the floor. Hold for 30 seconds per side."
        }
    ]
}