{
    "workoutName": "Aerobic & Strength Exercises",
    "goals": [
        "Increase Muscle Endurance",
        "Increase Stamina"
    ],
    "days": [
        {
            "day": "1",
            "name": "Endurance- Focused Workout",
            "duration": "60 Minutes",
            "description": "Warm-Up (5 Minutes)\nWarm-Up: Arm Swings (1 Minute)\nDescription: Swing both arms forward and backward in large, controlled arcs. Alternate directions every 30 seconds.\nWarm-Up: Standing Hip Circles (1 Minute)\nDescription: Stand with feet shoulder-width apart, place hands on hips, and rotate hips in a large circle. Perform 10 circles clockwise, then 10 counterclockwise.\nWarm-Up: Dynamic Lunges with Torso Twist (3 Minutes)\nDescription: Step forward into a lunge, then twist your torso toward your forward leg. Alternate sides for 10 reps each leg.\nExercise 1: Endurance Circuit (21 Minutes)\nRepeat 3 rounds with 1-minute rest between rounds:\nWall Sit with Heel Lifts – 1 Minute\nDescription: Hold a wall sit position while alternating lifting heels off the ground, activating quads and calves.\nRest 40 seconds\nStep-Ups with Controlled Descents – 1 Minute\nDescription: Step onto a box or bench with one leg, then step down slowly to focus on eccentric control.\nRest 40 seconds\nBear Crawl – 1 Minute\nDescription: Move forward and backward in a crawling position, keeping knees close to the ground and engaging the core.\nRest 40 seconds\nSuperman Hold – 1 Minute\nDescription: Lie face down and lift arms, chest, and legs off the ground, holding to strengthen the lower back and glutes.\nRest 1 Minute\nExercise 2: Core Endurance Circuit (15 Minutes)\nRepeat 3 rounds with 1-minute rest between rounds:\nSide Plank with Reach-Through – 45 Sec Each Side, 15 Sec Rest (1 Minute)\nDescription: In a side plank, reach your top arm under your torso and back up to work obliques.\nFlutter Kicks – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lie on your back and alternate small, quick leg kicks to target the core and hip flexors.\nSlow Bicycle Crunches – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform a bicycle crunch with slow, deliberate movements to engage all sections of the abs.\nBoat Pose Hold – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Hold a boat pose with legs lifted and torso reclined, engaging the core.\nRest 1 Minutes\nExercise 3: Long-Duration Burnout Circuit (15 Minutes)\nRepeat 3 rounds with 1-minute rest between rounds:\nLow-Impact Burpees – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform a burpee at a slower pace, skipping the jump at the top to maintain endurance.\nBodyweight Squat with 3-Second Hold – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Lower into a squat and hold for 3 seconds at the bottom before standing.\nResistance Band Rows – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Use a resistance band to perform slow, controlled rows to strengthen the back and arms.\nStanding Calf Raises – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Slowly rise onto the balls of your feet and lower back down, focusing on the calves.\nRest 1 minutes\nPost-Workout Stretch (4 Minutes)\nStanding Forward Fold – 1 Minute\nDescription: Bend at the hips and let your head hang, stretching the hamstrings and lower back.\nCat-Cow Stretch – 1 Minute\nDescription: Alternate between arching and rounding your back in a tabletop position to stretch the spine.\nRunner’s Lunge Stretch – 1 Minute\nDescription: Hold a deep lunge position to stretch the hip flexors and quads. Alternate sides after 1 minute.\nButterfly Stretch – 1 Minute\nDescription: Sit with soles of your feet together, gently pressing knees toward the ground to stretch the inner thighs.\nThis workout emphasizes endurance through slower, controlled movements and sustained holds while integrating both cardio and strength elements for long-duration exertion"
        },
        {
            "day": "2",
            "name": "Endurance- Focused Workout",
            "duration": "60 Minutes",
            "description": "Warm-Up (5 Minutes)\nStanding Arm Crossovers (1 Minute): Swing arms across your chest, alternating the top arm.\nLateral Lunges with Reach (2 Minutes): Step to the side, sink into a lunge, and reach toward the foot. Alternate sides.\nHigh Knee Walks (2 Minutes): March forward with high knees, reaching toward the opposite knee with each step.\nExercise 1: Endurance Circuit (21 Minutes)\nRepeat 3 rounds with 1-minute rest:\nPush-Up to Shoulder Tap – 1 Minute\nDescription: Perform a push-up, then tap one shoulder with the opposite hand, alternating sides.\nRest 40 seconds\nSplit Squat Hold – 30 Sec Each Side (1 Minute)\nDescription: Hold a lunge position without moving, keeping tension in the legs.\nRest 40 seconds\nSide-Stepping Squats – 1 Minute\nDescription: Take a step to the side, squat, return to standing, and repeat.\nRest 40 seconds\nSlow Jumping Jacks – 1 Minute\nDescription: Perform jumping jacks at a controlled pace.\nRest 1 minutes\n\nExercise 2: Core Endurance Circuit (15 Minutes)\nRepeat 3 rounds with 1-minute rest:\nPlank Shoulder Taps – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: In a plank, alternate tapping shoulders with opposite hands.\nStanding Side Crunches – 45 Sec Each Side (1 Minute)\nDescription: Stand and bring one knee up while crunching your torso sideways.\nStraight-Leg Sit-Ups – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform sit-ups with legs extended straight in front of you.\nSide Plank with Arm Reach – 45 Sec Each Side (1 Minute)\nDescription: Hold a side plank and extend the top arm overhead.\nRest 1 Minute\n\n\nExercise 3: Long-Duration Burnout Circuit (15 Minutes)\n\nRepeat 3 rounds with 2-minute rest:\nWall Ball Squats – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Perform squats with a medicine ball, throwing it against a wall.\nStep-Up to Knee Drive – 20 Sec Each Side, 20 Sec Rest (1 Minute)\nDescription: Step onto a bench and drive the opposite knee upward.\nPlank to Side Plank Rotations – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Transition from a forearm plank to a side plank on each side.\nBox Shuffle – 45 Sec On, 15 Sec Rest (1 Minute)\nDescription: Stand in front of a box and step up, down, and around quickly.\nRest 1 Minute\nCool Down (4 Minutes)\nLight Jump Rope (4 Minutes): A steady pace, focusing on rhythmic breathing."
        }
    ]
}